

# โ๏ธ **Basic OSPF Configuration**

(ุงูุชููุฆุฉ ุงูุฃุณุงุณูุฉ ูุจุฑูุชูููู OSPF)

ุฑุงุญ ุฃุดุฑุญูุง ูู ุจุงูุชูุตููุ ุฎุทูุฉ ุจุฎุทูุฉ ูุน ุฃูุงูุฑ **Cisco IOS** + ุชูุถูุญ ูู ุดูุก ุจุตูุฑ ุฐูููุฉ ูุงุถุญุฉ ๐

---

## ๐งญ ุฃูููุง: ูุง ูู OSPF ุจุฅูุฌุงุฒ

> OSPF = **Open Shortest Path First**  
> ูู ุจุฑูุชูููู ุชูุฌูู ุฏููุงูููู (Dynamic Routing Protocol)  
> ูุนุชูุฏ ุนูู ุฎูุงุฑุฒููุฉ **Link-State**  
> ูููุณุชุฎุฏู ูุจูุงุก ุดุจูุฉ ุฐููุฉ ุชุนุฑู ุชููุงุฆููุง ุฃูุถู ุงููุณุงุฑุงุช.

---

## ๐งฉ ุฃููุงุน ุจุฑูุชููููุงุช ุงูุชูุฌูู (ูุชููู ูููุน OSPF)

|ุงูููุน|ูุซุงู|ุทุฑููุฉ ุงูุนูู|
|---|---|---|
|Distance Vector|RIP|ูุนุชูุฏ ุนูู ุนุฏุฏ ุงูููุฒุงุช (Hops)|
|Link-State|OSPF|ูุนุชูุฏ ุนูู ุญุงูุฉ ุงูุฑูุงุจุท ูุงูุชูููุฉ|
|Hybrid|EIGRP|ูุฒูุฌ ูู ุงูุงุซููู|

---

## ๐ ุฎุทูุงุช ุชูููู OSPF ุงูุฃุณุงุณูุฉ

ููุชุฑุถ ุนูุฏูุง 3 ุฑุงูุชุฑุงุช ุจุงูุดูู ุงูุชุงูู:

```
R1 ----- R2 ----- R3
```

ูู ุฑุงุจุท ุจุดุจูุฉ ูุฎุชููุฉ:

|ุงูุฑุงุจุท|ุงูุดุจูุฉ|ุงููุงุฌูุฉ ุนูู R1|
|---|---|---|
|R1โR2|10.0.0.0/30|G0/0|
|R2โR3|10.0.0.4/30|G0/1|
|R1 LAN|192.168.1.0/24|G0/1|
|R3 LAN|192.168.3.0/24|G0/1|

---

## ๐น ุงูุฎุทูุฉ 1: ุชูุนูู OSPF ุนูู ุงูุฑุงูุชุฑ

```cisco
R1(config)# router ospf 1
```

> ุงูุฑูู (1) ูู **Process ID** โ ูุญูู ููุท ุฏุงุฎู ุงูุฑุงูุชุฑ (ูุงุฒู ูุชุทุงุจูุ โ ูุงุ ูู ุฑุงูุชุฑ ููุฏุฑ ูุฎุชุงุฑ ุฃู ุฑูู ุฏุงุฎูู).

---

## ๐น ุงูุฎุทูุฉ 2: ุชุนุฑูู ุงูุดุจูุงุช ุงููุดุงุฑูุฉ ูู OSPF

```cisco
R1(config-router)# network 10.0.0.0 0.0.0.3 area 0
R1(config-router)# network 192.168.1.0 0.0.0.255 area 0
```

### ๐ ุดุฑุญ ุงูุฃูุฑ:

```
network <network_address> <wildcard_mask> area <area_id>
```

- **network address:** ุงูุดุจูุฉ ุงููู ูููุง ุงููุงุฌูุฉ.
    
- **wildcard mask:** ุนูุณ ุงูู subnet mask.
    
    - ูุซุงู: 255.255.255.0 โ 0.0.0.255
        
- **area id:** ุฑูู ุงูููุทูุฉ (ุนุงุฏุฉ 0 ููู Backbone).
    

โ **Area 0** = ุงูุนููุฏ ุงูููุฑู (Backbone Area)  
ูู ุงูููุงุทู ุงูุฃุฎุฑู ูุฌุจ ุฃู ุชุชุตู ุจู ูุจุงุดุฑุฉ.

---

## ๐น ุงูุฎุทูุฉ 3: ุงูุชุฃูุฏ ูู ุชูููู ุงูุฌูุฑุงู

```cisco
R1# show ip ospf neighbor
```

ุงููุงุชุฌ ุงููุชููุน:

```
Neighbor ID     Pri   State      Dead Time   Address     Interface
2.2.2.2           1   FULL/DR    00:00:33    10.0.0.2    Gig0/0
```

ูุนูุงู ุฃู R1 ูR2 ุฃุตุจุญุง ุฌูุฑุงููุง ูู OSPF ๐ค

---

## ๐น ุงูุฎุทูุฉ 4: ุนุฑุถ ุงูุดุจูุงุช ุงูุชู ุชุนูููุง OSPF

```cisco
R1# show ip route ospf
```

ุชุธูุฑ ุงููุณุงุฑุงุช ุงูุชู ุชุนูููุง ุนุจุฑ OSPF ูุณุจููุฉ ุจุงูุญุฑู **O** ูุซู:

```
O     192.168.3.0/24 [110/2] via 10.0.0.2, 00:00:10, Gig0/0
```

---

## ๐น ุงูุฎุทูุฉ 5: ุชูุนูู OSPF ุนูู ูุงุฌูุฉ ูุญุฏุฏุฉ (ุทุฑููุฉ ุจุฏููุฉ)

ุจุฏู ุงุณุชุฎุฏุงู ุงูุฃูุฑ `network`ุ ุชูุฏุฑ ุชูุนูู OSPF ูุจุงุดุฑุฉ ุนูู ุงููุงุฌูุฉ:

```cisco
R1(config)# interface g0/0
R1(config-if)# ip ospf 1 area 0
```

> ูููุฏ ูู ููุช ุชุจู ุชุชุญูู ุจุฏูุฉ ุฃู ูุงุฌูุงุช ุชุฏุฎู ูู OSPF ุจุฏูู wildcard.

---

## ๐น ุงูุฎุทูุฉ 6: ุงูุชุญูู ูู ุฅุนุฏุงุฏุงุช OSPF

```cisco
R1# show ip ospf
```

ูุนุฑุถ:

- Router ID
    
- Area IDs
    
- Timers
    
- LSAs
    
- Cost ููู ูุงุฌูุฉ
    

---

## ๐ง ููุงุญุธุงุช ูููุฉ ุฌุฏูุง

|ุงูููุทุฉ|ุงูุชูุถูุญ|
|---|---|
|**Router ID**|ุฑูู ูุนุฑูู ุงูุฑุงูุชุฑ ุฏุงุฎู OSPF โ ููุฎุชุงุฑ ุชููุงุฆููุง (ุฃูุจุฑ IP) ุฃู ูููู ุชุนูููู ูุฏูููุง: `router-id 1.1.1.1`|
|**Hello Timer**|ูู 10 ุซูุงูู ุนุงุฏุฉ (Ethernet)|
|**Dead Timer**|4รHello = 40 ุซุงููุฉ|
|**OSPF Cost**|ูุนุชูุฏ ุนูู ุณุฑุนุฉ ุงููุงุฌูุฉ: `Cost = 100,000,000 / Bandwidth`|
|**Administrative Distance**|ุงููููุฉ ุงูุงูุชุฑุงุถูุฉ = **110**|
|**Multicast Addresses**|224.0.0.5 (AllSPFRouters) / 224.0.0.6 (AllDRouters)|

---

## ๐งพ ูุซุงู ุดุงูู (R1, R2, R3)

```cisco
! R1
router ospf 1
 router-id 1.1.1.1
 network 10.0.0.0 0.0.0.3 area 0
 network 192.168.1.0 0.0.0.255 area 0

! R2
router ospf 1
 router-id 2.2.2.2
 network 10.0.0.0 0.0.0.3 area 0
 network 10.0.0.4 0.0.0.3 area 0

! R3
router ospf 1
 router-id 3.3.3.3
 network 10.0.0.4 0.0.0.3 area 0
 network 192.168.3.0 0.0.0.255 area 0
```

ุงููุชูุฌุฉ ๐:

- ูู ุงูุฑุงูุชุฑุงุช ูู ููุณ ุงูู Area 0
    
- ูููู ุฃุตุจุญูุง ุฌูุฑุงู (Neighbors)
    
- ุฌููุน ุงูุดุจูุงุช ุงูุฏุงุฎููุฉ ุชู ุชุจุงุฏููุง ุจูุฌุงุญ
    

---

## ๐งฉ ุฃูุงูุฑ ุงููุฑุงูุจุฉ ุงูุณุฑูุนุฉ

|ุงูุฃูุฑ|ุงููุธููุฉ|
|---|---|
|`show ip ospf neighbor`|ูุนุฑุถ ุงูุฌูุฑุงู|
|`show ip ospf database`|ูุนุฑุถ ุงูู LSAs|
|`show ip route ospf`|ูุนุฑุถ ุงููุณุงุฑุงุช ุงูุชู ุชุนูููุง OSPF|
|`show ip ospf interface`|ุชูุงุตูู ูุงุฌูุงุช OSPF|
|`debug ip ospf hello`|ูุฑุงูุจุฉ Hello packets|

---

## โ ููุฎุต ุณุฑูุน:

|ุงูุฎุทูุฉ|ุงูุฃูุฑ|ุงููุธููุฉ|
|---|---|---|
|1|`router ospf 1`|ุชุดุบูู OSPF|
|2|`network x.x.x.x 0.0.0.x area 0`|ุชุนุฑูู ุงูุดุจูุงุช|
|3|`show ip ospf neighbor`|ุชุญูู ูู ุงูุฌูุฑุงู|
|4|`show ip route ospf`|ุชุญูู ูู ุงููุณุงุฑุงุช|
|5|`router-id`|ุชุญุฏูุฏ ูููุฉ ุงูุฑุงูุชุฑ ุฏุงุฎู OSPF|

---

ูู ุชุฑุบุจ ุฃู ุฃุดุฑุญ ุงูุขู **Advanced OSPF Configuration** (ูุซู: Multi-Area OSPFุ Passive Interfaceุ Router IDุ Authenticationุ Cost tuning...)?  
ูููู ูููู ุงููุณุชูู ุงููุชูุณุท ุจุนุฏ ูุฐุง ุงูุฃุณุงุณ.